Repository: alexpattyn/cozy
Catalog: po/extra/*.po
Languages: fi

source: Audio Book Player
fi: Äänikirjojen toisto-ohjelma

source: Play and organize your audio book collection
fi: Toista ja järjestele äänikirjakokoelmasi

source: A modern audio book player
fi: Nykyaikainen äänikirjojen toisto-ohjelma

source: Do you like audio books? Then lets get cozy!
fi: Pidätkö äänikirjoista? Ota Cozy haltuun!

source: Cozy is a modern audio book player. Here are some of the current features:
fi: Cozy on nykyaikainen äänikirjojen toisto-ohjelma. Tässä joitakin tämänhetkisiä toimintoja:

source: Import all your audio books into cozy to browse them comfortably
fi: Tuo kaikki äänikirjasi Cozyyn selataksesi niitä mukavasti

source: Listen to your DRM free mp3, m4b, m4a (aac, ALAC, …), flac, ogg and wav audio books
fi: Kuuntele DRM-vapaita mp3, m4b (aac, ALAC, ...), flac, ogg ja wav-tiedostomuotoisia äänikirjojasi

source: Remembers your playback position
fi: Ohjelma muistaa kohdan johon toisto on jäänyt

source: Sleep timer!
fi: Uniajastin!

source: Playback speed control for each book individually
fi: Toiston nopeudenhallinta jokaiselle kirjalle yksilöllisesti

source: Search your library
fi: Etsi kirjastostasi

source: Multiple storage location support
fi: Monitallennussijaintituki

source: Offline Mode! This allows you to keep an audio book on your internal storage if you store your audio books on an external or network drive. Perfect to listen to on the go!
fi: Yhteydetön tila! Tämä mahdollistaa äänikirjojesi säilyttämisen sisäisessä tallennustilassa mikäli varastoit äänikirjoja ulkoiseen verkkoasemaan. Sopii hyvin liikkuvaan kuunteluun!

source: Drag and Drop to import new audio books
fi: Raahaa ja pudota tuodaksesi kirjastoon uusia äänikirjoja

source: Sort your audio books by author, reader and name
fi: Lajittele äänikirjasi tekijän, lukijan ja nimen mukaan

source: A small bugfix release which makes Cozy more reliable.
fi: Pienikokoinen virheenkorjauksiin perustuva julkaisu joka tekee Cozysta entistäkin luotettavamman.

source: Display an error banner if an error occurs while importing new files
fi: Tuo näytölle virheilmoitus mikäli ilmenee virhe uusia tiedostoja tuotaessa

source: The audiobook directory selector in the empty state has been replaced by a button to allow a narrow window even with long directory names
fi: Äänikirjahakemiston valitsija joka ilmenee tyhjässä tilassa on korvattu painikkeella mahdollistaen kapean ikkunoinnin jopa pitkien hakemistonimien suhteen

source: Fix: multiple small UI issues
fi: Korjaus: useita pieniä käyttöliittymän ongelmia

source: Fix: the welcome screen now works properly on a mobile device
fi: Korjaus: tervetuloruutu toimii nyt kunnollisesti mobiililaitteessa

source: Fix: don't display the mobile library switcher when no files are imported
fi: Korjaus: älä näytä mobiilin kirjastonvaihtajaa kun yhtäkään tiedostoa ei tuoda

source: Fix: in the book detail view the pause icon for a chapter remained even when the next chapter already started playing
fi: Korjaus: kirjan yksityiskohtaisessa lisätietonäkymässä taukokuvake säilyi edelleen vaikkakin uusi luku oli jo toistossa

source: As always, updated translations thanks to all of the translators!
fi: Kuten aina, päivitetyt kielikäännökset ovat täällä; kiitokset kaikille suomentajille!

source: This release features a redesigned library with responsiveness in mind.
fi: Tämä julkaisu sisältää uudelleensuunnitellun kirjaston jossa on otettu huomioon, että ohjelma vastaa nopeammin toimintoja käynnistellessä.

source: Redesigned library
fi: Kirjasto on suunniteltu uusiksi

source: Redesigned start screen
fi: Aloitusruutu suunniteltu uusiksi

source: Redesigned book detail screen
fi: Kirjan yksityiskohtainen lisätietonäkymä suunniteltu uusiksi

source: Responsive design for the main window
fi: Pääikkuna vastaa nyt käskyihin ja napsautuksiisi nopeammin

source: Introducing a welcome screen for new installations
fi: Uusille asennuksille on tehty nyt tervetuliaisikkuna

source: Fix: a rare bug where Cozy's volume was muted at first start
fi: Korjaus: harvinainen virhe jossa Cozyn äänentaso oli vaiennettuna ensikäynnistyksellä

source: Fix: long book names or author names will be truncated properly
fi: Korjaus: pitkät kirjannimet taikka tekijänimet saadaan nyt typistettyä kelvollisesti

source: Performance improvements for the book detail view and some bugfixes.
fi: Suorituskyvyn parannuksia kirjan tietonäkymään sekä joitakin virheenkorjauksia.

source: Chapters in the book detail view will now be loaded lazily (thanks chris-kobrzak!)
fi: Luvut kirjan yksityskohtaisessa tietonäkymässä lataantuvat nyt rivakammin (kiitos chris-kobrzakille!)

source: Books with a single chapter don't display a chapter number anymore (thanks chris-kobrzak!)
fi: Kirjat jotka sisältävät vain yhden ainoan luvun, eivät tuo esille enää lukunäkymää (kiitokset chris-kobrzakille!)

source: Fix: Locals in What's new in Cozy screen (thanks alyssais!)
fi: Korjaus: Paikalliset -osio Mitä uutta -näkymässä (kiitos alyssais!)

source: Fix: Catch an error that could occur when a book stops
fi: Korjaus: virheenkoppaus joka saattaa ilmetä kun kirjan toisto pysäytetään

source: Small performance improvements
fi: Pieniä parannuksia suorituskykyyn

source: When an issue occurs during playback the error message is displayed to the user
fi: Kun ilmenee virhe kirjaa toistettaessa, tuodaan käyttäjälle nyt näytille siihen liittyvä virheilmoitus

source: Fix: Importing media without tags now properly decodes the file name as chapter name (thanks chris-kobrzak!)
fi: Korjaus: tuotaessa kirjastoon materiaalia jossa ei ole tunnisteita, käytetäänkin nyt hyväksi itse tiedostonimeä ja luodaan siitä nimi luvulle (kiitokset chris-kobrzakille!)

source: Fix: Ensure that always a default storage location is present
fi: Korjaus: varmistus, että vakiollinen säilytystilakohde on läsnä

source: Fix: During import an error could occur which stopped the import
fi: Korjaus: ei enää virhettä joka joskus ilmeni aineistoa tuotaessa ja joka lopetti toiminnon

source: Fix: During the database migration an error could occur
fi: Korjaus: tietokantasiirtymän aikana ilmeni ajoittainen virhe

source: When copying files to the audiobook library goes wrong, the user is now informed with the error
fi: Mikäli tiedostojen jäljentäminen äänikirjastoon meni mönkään, käyttäjää tiedotetaan siitä nyt

source: Fix: Possible error while displaying offline cache copy progress
fi: Korjaus: mahdollinen virhe näytettäessä välimuistin verkkoyhteydetöntä jäljennösedistymistä

source: Fix: When changing the audiobook location or selecting a file in the file not found dialog an unexpected error could occur
fi: Korjaus: muutettaessa äänikirjan sijaintia tai valitessa tiedostoa, saattoi joskus ilmetä "tiedostoa ei löydy" -herja, johtaen odottamattomaan virheeseen

source: Fix: Removing a storage dir in settings did not work
fi: Korjaus: poistettaessa tallennustilahakemistoa asetuksista ei toiminut. Nyt toimii

source: Fix: Removing a book from the library did sometimes not work
fi: Korjaus: kirjan poistaminen kirjastosta ei aina onnistunut.

source: This release features chapter support for m4b files.
fi: Tämä julkaisu sisältää tuen eri luvuille m4b-tiedostojen suhteen.

source: A long awaited feature has finally arrived: Chapter support for m4b files.
fi: Pitkään odotettu ominaisuus on viimenkin saapunut: lukujen tuki m4b-tiedostojen kanssa.

source: Books with inconsistent spelling are now grouped into a single book (thanks chris-kobrzak!).
fi: Kirjat joissa on epäjohdonmukaista kielioppia ovat nyt ryhmitetyt yhdeksi kirjaksi (kiitokset chris-kobrzakille!)

source: Improved reliability of restoring the previous playback position.
fi: Parannusta kirjankuuntelun jatkamiseksi edellisen toiston tiimoilta jäädystä toistokohdasta.

source: Fix: clicking on a currently playing chapter did not pause the chapter as expected.
fi: Korjaus: napsauttaessa sillä hetkellä toistossa olevan luvun päällä ei aiemmin tauottanut toistoa kuten tarkoitus.
